package by.academy.lesson19;
/*
 * Обедающие философы. Пять безмолвных философов сидят вокруг круглого стола, 
перед каждым философом стоит тарелка спагетти. 
Вилки лежат на столе между каждой парой ближайших философов. 
Каждый философ может либо есть, либо размышлять. 
Философ может есть только тогда, когда держит две вилки — взятую справа и слева. 
Взятие каждой вилки и возвращение её на стол являются раздельными действиями, 
которые должны выполняться одно за другим.
 */

public class Task5 {

	public static void main(String[] args) {

		System.out.println("Философ берет правую вилку");
		System.out.println("Философ берет левую вилку");
		System.out.println("Философ ест");
		System.out.println("Философ кладет правую вилку");
		System.out.println("Философ кладет левую вилку");
		System.out.println("Философ размышляет");
	}

}
